## Moneyball Exercise 15, The Iron Yard
- Creating the best team for the lowest cost.

* The key objective is to determine the 'best' players based on performance per salary.
* The current year data is being used to determine the performance.  
* The performance alogorthm will then be applied to each year.

## Analysis plan:
1. read in only the full tables that will contain the variables of interest. 
2. the full tables will be trimmed to include those columns of interest.
3. a final table will be constructed using the combined data [data cleaned, columns transformed, stats calculated]

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
%matplotlib inline

In [11]:
master = pd.read_csv('lahman-csv_2014-02-14/Master.csv', sep=',', header=0)

In [12]:
master.head(3)

,playerID,birthYear,birthMonth,birthDay,birthCountry,birthState,birthCity,deathYear,deathMonth,deathDay,...,nameLast,nameGiven,weight,height,bats,throws,debut,finalGame,retroID,bbrefID
0,aardsda01,1981,12,27,USA,CO,Denver,NaN,NaN,NaN,...,Aardsma,David Allan,205,75,R,R,2004-04-06,2013-09-28,aardd001,aardsda01
1,aaronha01,1934,2,5,USA,AL,Mobile,NaN,NaN,NaN,...,Aaron,Henry Louis,180,72,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
2,aaronto01,1939,8,5,USA,AL,Mobile,1984,8,16,...,Aaron,Tommie Lee,190,75,R,R,1962-04-10,1971-09-26,aarot101,aaronto01

In [44]:
mastertrim = master[['playerID','nameGiven','birthYear','finalGame']]

In [45]:
mastertrim.head()

    playerID       nameGiven  birthYear   finalGame
0  aardsda01     David Allan       1981  2013-09-28
1  aaronha01     Henry Louis       1934  1976-10-03
2  aaronto01      Tommie Lee       1939  1971-09-26
3   aasedo01  Donald William       1954  1990-10-03
4   abadan01   Fausto Andres       1972  2006-04-13

In [46]:
batting = pd.read_csv('lahman-csv_2014-02-14/Batting.csv', sep=',', header=0)

In [47]:
batting.head()

,playerID,yearID,stint,teamID,lgID,G,G_batting,AB,R,H,...,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP,G_old
0,aardsda01,2004,1,SFN,NL,11,11,0,0,0,...,0,0,0,0,0,0,0,0,0,11
1,aardsda01,2006,1,CHN,NL,45,43,2,0,0,...,0,0,0,0,0,0,1,0,0,45
2,aardsda01,2007,1,CHA,AL,25,2,0,0,0,...,0,0,0,0,0,0,0,0,0,2
3,aardsda01,2008,1,BOS,AL,47,5,1,0,0,...,0,0,0,1,0,0,0,0,0,5
4,aardsda01,2009,1,SEA,AL,73,3,0,0,0,...,0,0,0,0,0,0,0,0,0,NaN

In [48]:
battingtrim = batting[['playerID', 'yearID', 'teamID', 'AB', 'G','H','BB','HBP','SH']]

In [49]:
battingtrim.head()

    playerID  yearID teamID  AB   G  H  BB  HBP  SH
0  aardsda01    2004    SFN   0  11  0   0    0   0
1  aardsda01    2006    CHN   2  45  0   0    0   1
2  aardsda01    2007    CHA   0  25  0   0    0   0
3  aardsda01    2008    BOS   1  47  0   0    0   0
4  aardsda01    2009    SEA   0  73  0   0    0   0

In [50]:
salaries = pd.read_csv('lahman-csv_2014-02-14/Salaries.csv', sep=',', header=0)

In [51]:
salaries.head()

   yearID teamID lgID   playerID   salary
0    1985    BAL   AL  murraed02  1472819
1    1985    BAL   AL   lynnfr01  1090000
2    1985    BAL   AL  ripkeca01   800000
3    1985    BAL   AL   lacyle01   725000
4    1985    BAL   AL  flanami01   641667

In [52]:
salarytrim = salaries[['playerID', 'yearID','teamID','salary']]

In [53]:
salarytrim.head()

    playerID  yearID teamID   salary
0  murraed02    1985    BAL  1472819
1   lynnfr01    1985    BAL  1090000
2  ripkeca01    1985    BAL   800000
3   lacyle01    1985    BAL   725000
4  flanami01    1985    BAL   641667

In [54]:
salarytrim.count()

playerID    23956
yearID      23956
teamID      23956
salary      23956
dtype: int64

In [55]:
mastertrim.count()

playerID     18354
nameGiven    18310
birthYear    18200
finalGame    18165
dtype: int64

In [56]:
battingtrim.count()

playerID    97889
yearID      97889
teamID      97889
AB          91476
G           97889
H           91476
BB          91476
HBP         88656
SH          85138
dtype: int64

Assume that the annual stats have been normalized across teams for any given player.

In [57]:
bbfile = pd.merge(salarytrim, mastertrim)

In [58]:
bbfile.head(10)

    playerID  yearID teamID   salary       nameGiven  birthYear   finalGame
0  murraed02    1985    BAL  1472819  Eddie Clarence       1956  1997-09-20
1  murraed02    1986    BAL   925814  Eddie Clarence       1956  1997-09-20
2  murraed02    1987    BAL  2044757  Eddie Clarence       1956  1997-09-20
3  murraed02    1988    BAL  2142904  Eddie Clarence       1956  1997-09-20
4  murraed02    1989    LAN  2331062  Eddie Clarence       1956  1997-09-20
5  murraed02    1990    LAN  2513703  Eddie Clarence       1956  1997-09-20
6  murraed02    1991    LAN  2628164  Eddie Clarence       1956  1997-09-20
7  murraed02    1992    NYN  4125000  Eddie Clarence       1956  1997-09-20
8  murraed02    1993    NYN  3375000  Eddie Clarence       1956  1997-09-20
9  murraed02    1994    CLE  3000000  Eddie Clarence       1956  1997-09-20

In [59]:
bbfile.count()

playerID     23956
yearID       23956
teamID       23956
salary       23956
nameGiven    23956
birthYear    23956
finalGame    23956
dtype: int64

In [60]:
totfile = pd.merge(bbfile,battingtrim)

In [61]:
totfile.head()

,playerID,yearID,teamID,salary,nameGiven,birthYear,finalGame,AB,G,H,BB,HBP,SH
0,murraed02,1985,BAL,1472819,Eddie Clarence,1956,1997-09-20,583,156,173,84,2,0
1,murraed02,1986,BAL,925814,Eddie Clarence,1956,1997-09-20,495,137,151,78,0,0
2,murraed02,1987,BAL,2044757,Eddie Clarence,1956,1997-09-20,618,160,171,73,0,0
3,murraed02,1988,BAL,2142904,Eddie Clarence,1956,1997-09-20,603,161,171,75,0,0
4,murraed02,1989,LAN,2331062,Eddie Clarence,1956,1997-09-20,594,160,147,87,2,0

In [62]:
totfile.count()

playerID     22871
yearID       22871
teamID       22871
salary       22871
nameGiven    22871
birthYear    22871
finalGame    22871
AB           20618
G            22871
H            20618
BB           20618
HBP          20609
SH           20618
dtype: int64

In [67]:
totfile['OBP'] = ((totfile['H'] + totfile['BB'] + totfile['HBP'])/(totfile['AB'] + totfile['BB'] + totfile['HBP'] + totfile['SH']))

In [68]:
totfile.head(3)

,playerID,yearID,teamID,salary,nameGiven,birthYear,finalGame,AB,G,H,BB,HBP,SH,OBP
0,murraed02,1985,BAL,1472819,Eddie Clarence,1956,1997-09-20,583,156,173,84,2,0,0.387145
1,murraed02,1986,BAL,925814,Eddie Clarence,1956,1997-09-20,495,137,151,78,0,0,0.399651
2,murraed02,1987,BAL,2044757,Eddie Clarence,1956,1997-09-20,618,160,171,73,0,0,0.353111

In [69]:
totfile.count()

playerID     22871
yearID       22871
teamID       22871
salary       22871
nameGiven    22871
birthYear    22871
finalGame    22871
AB           20618
G            22871
H            20618
BB           20618
HBP          20609
SH           20618
OBP          18108
dtype: int64

In [70]:
totfile.describe()

,yearID,salary,birthYear,AB,G,H,BB,HBP,SH,OBP
count,22871.000000,22871.000000,22871.000000,20618.000000,22871.00000,20618.000000,20618.000000,20609.000000,20618.000000,18108.000000
mean,1999.362162,1888500.460146,1969.843689,193.245805,67.87224,51.124794,19.085653,1.713766,1.887962,0.266165
std,8.020054,3100132.146168,8.812243,207.066756,47.76365,59.000818,24.602970,2.973277,3.008365,0.139909
min,1985.000000,0.000000,1939.000000,0.000000,1.00000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,1993.000000,250000.000000,1964.000000,5.000000,29.00000,1.000000,0.000000,0.000000,0.000000,0.200000
50%,1999.000000,530000.000000,1970.000000,99.000000,56.00000,23.000000,8.000000,0.000000,0.000000,0.304445
75%,2006.000000,2150000.000000,1976.000000,366.000000,108.00000,96.000000,32.000000,2.000000,3.000000,0.345946
max,2013.000000,33000000.000000,1993.000000,716.000000,163.00000,262.000000,232.000000,35.000000,39.000000,1.000000

Need to add the Appearance data to capture the key 9 positions associated with players:

In [71]:
positions = pd.read_csv('lahman-csv_2014-02-14/Appearances.csv', sep=',', header=0)

In [72]:
positions.head()

,yearID,teamID,lgID,playerID,G_all,GS,G_batting,G_defense,G_p,G_c,...,G_2b,G_3b,G_ss,G_lf,G_cf,G_rf,G_of,G_dh,G_ph,G_pr
0,1871,TRO,NaN,abercda01,1,NaN,1,1,0,0,...,0,0,1,0,0,0,0,NaN,NaN,NaN
1,1871,RC1,NaN,addybo01,25,NaN,25,25,0,0,...,22,0,3,0,0,0,0,NaN,NaN,NaN
2,1871,CL1,NaN,allisar01,29,NaN,29,29,0,0,...,2,0,0,0,29,0,29,NaN,NaN,NaN
3,1871,WS3,NaN,allisdo01,27,NaN,27,27,0,27,...,0,0,0,0,0,0,0,NaN,NaN,NaN
4,1871,RC1,NaN,ansonca01,25,NaN,25,25,0,5,...,2,20,0,1,0,0,1,NaN,NaN,NaN

In [73]:
positiontrim = positions[['playerID','yearID','teamID','G_p', 'G_c','G_1b','G_2b','G_3b','G_ss','G_lf','G_cf','G_of']]

In [74]:
positiontrim.head()

,playerID,yearID,teamID,G_p,G_c,G_1b,G_2b,G_3b,G_ss,G_lf,G_cf,G_of
0,abercda01,1871,TRO,0,0,0,0,0,1,0,0,0
1,addybo01,1871,RC1,0,0,0,22,0,3,0,0,0
2,allisar01,1871,CL1,0,0,0,2,0,0,0,29,29
3,allisdo01,1871,WS3,0,27,0,0,0,0,0,0,0
4,ansonca01,1871,RC1,0,5,1,2,20,0,1,0,1

In [75]:
finalbb = pd.merge(totfile, positiontrim)

In [76]:
finalbb.head()

,playerID,yearID,teamID,salary,nameGiven,birthYear,finalGame,AB,G,H,...,OBP,G_p,G_c,G_1b,G_2b,G_3b,G_ss,G_lf,G_cf,G_of
0,murraed02,1985,BAL,1472819,Eddie Clarence,1956,1997-09-20,583,156,173,...,0.387145,0,0,154,0,0,0,0,0,0
1,murraed02,1986,BAL,925814,Eddie Clarence,1956,1997-09-20,495,137,151,...,0.399651,0,0,119,0,0,0,0,0,0
2,murraed02,1987,BAL,2044757,Eddie Clarence,1956,1997-09-20,618,160,171,...,0.353111,0,0,156,0,0,0,0,0,0
3,murraed02,1988,BAL,2142904,Eddie Clarence,1956,1997-09-20,603,161,171,...,0.362832,0,0,103,0,0,0,0,0,0
4,murraed02,1989,LAN,2331062,Eddie Clarence,1956,1997-09-20,594,160,147,...,0.345534,0,0,159,0,2,0,0,0,0

In [77]:
finalbb.count()

playerID     22788
yearID       22788
teamID       22788
salary       22788
nameGiven    22788
birthYear    22788
finalGame    22788
AB           20537
G            22788
H            20537
BB           20537
HBP          20528
SH           20537
OBP          18048
G_p          22788
G_c          22788
G_1b         22788
G_2b         22788
G_3b         22788
G_ss         22788
G_lf         22788
G_cf         22788
G_of         22788
dtype: int64

In [78]:
decision_set= finalbb[['playerID','yearID','teamID','nameGiven', 'G_p','G_c','G_1b','G_2b','G_3b','G_ss','G_lf','G_cf','G_of','salary', 'OBP' ]]

In [79]:
decision_set.head()

,playerID,yearID,teamID,nameGiven,G_p,G_c,G_1b,G_2b,G_3b,G_ss,G_lf,G_cf,G_of,salary,OBP
0,murraed02,1985,BAL,Eddie Clarence,0,0,154,0,0,0,0,0,0,1472819,0.387145
1,murraed02,1986,BAL,Eddie Clarence,0,0,119,0,0,0,0,0,0,925814,0.399651
2,murraed02,1987,BAL,Eddie Clarence,0,0,156,0,0,0,0,0,0,2044757,0.353111
3,murraed02,1988,BAL,Eddie Clarence,0,0,103,0,0,0,0,0,0,2142904,0.362832
4,murraed02,1989,LAN,Eddie Clarence,0,0,159,0,2,0,0,0,0,2331062,0.345534